src/src/DataProcessors/MonthEndClosing.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>MonthEndClosing</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Period</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/src/Documents/FixedAssetsDepreciation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>FixedAssetsDepreciation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.AccountingJournalEntries</xr:Item>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
				<xr:Item>InformationRegister.MonthEndErrors</xr:Item>
				<xr:Item>AccumulationRegister.FixedAssets</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/Documents/MonthEndClosing.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>MonthEndClosing</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ForeignExchangeGainsAndLosses</xr:Item>
				<xr:Item>AccumulationRegister.CashInCashRegisters</xr:Item>
				<xr:Item>AccumulationRegister.Sales</xr:Item>
				<xr:Item>AccumulationRegister.LandedCosts</xr:Item>
				<xr:Item>AccumulationRegister.POSSummary</xr:Item>
				<xr:Item>AccumulationRegister.FinancialResult</xr:Item>
				<xr:Item>AccumulationRegister.AdvanceHolders</xr:Item>
				<xr:Item>InformationRegister.WriteOffCostAdjustment</xr:Item>
				<xr:Item>AccountingRegister.AccountingJournalEntries</xr:Item>
				<xr:Item>AccumulationRegister.TaxPayable</xr:Item>
				<xr:Item>AccumulationRegister.AccountsReceivable</xr:Item>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.Payroll</xr:Item>
				<xr:Item>AccumulationRegister.CashAssets</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
				<xr:Item>AccumulationRegister.AccountsPayable</xr:Item>
				<xr:Item>InformationRegister.MonthEndErrors</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DirectCostCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CostAllocation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActualCostCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinancialResultCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeDifferencesCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetailCostCalculationEarningAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VerifyTaxInvoices</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATPayableCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/DataProcessors/MonthEndClosing/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

Procedure ExecuteMonthEnd(ParametersStructure, BackgroundJobStorageAddress = "") Export
	
	CurMonth = ParametersStructure.CurMonth;
	CurYear = ParametersStructure.CurYear;
	Company = ParametersStructure.Company;
	OperationArray = ParametersStructure.OperationArray;
	
	StructureOfCurrentDocuments = CancelMonthEnd(ParametersStructure);
	
	If ParametersStructure.ExecuteCalculationOfDepreciation Then
		
		If ValueIsFilled(StructureOfCurrentDocuments.DocumentFixedAssetsDepreciation) Then
			
			DocObject = StructureOfCurrentDocuments.DocumentFixedAssetsDepreciation.GetObject();
			If DocObject.DeletionMark Then
				DocObject.SetDeletionMark(False);
			EndIf;
			
		Else
			
			DocObject = Documents.FixedAssetsDepreciation.CreateDocument();
			DocObject.Company = Company;
			DocObject.Date = EndOfMonth(Date(CurYear, CurMonth, 1));
			DocObject.Comment = NStr("en = '#Created automatically using month-end closing wizard.'");
			
		EndIf;
		
		DocObject.Write(DocumentWriteMode.Posting);
		
	EndIf;
	
	RunOperationClosingMonth(ParametersStructure, OperationArray, StructureOfCurrentDocuments.DocumentMonthEnd);
	
EndProcedure

Function CancelMonthEnd(ParametersStructure) Export
	
	CurMonth = ParametersStructure.CurMonth;
	CurYear = ParametersStructure.CurYear;
	Company = ParametersStructure.Company;
	
	ReturnStructure = New Structure("DocumentMonthEnd, DocumentFixedAssetsDepreciation");
	
	Query = New Query;
	
	Query.Text =
	"SELECT
	|	MonthEndClosing.Date AS Date,
	|	MonthEndClosing.Ref AS Ref
	|FROM
	|	Document.MonthEndClosing AS MonthEndClosing
	|WHERE
	|	YEAR(MonthEndClosing.Date) = &Year
	|	AND MONTH(MonthEndClosing.Date) = &Month
	|	AND MonthEndClosing.Company = &Company
	|
	|ORDER BY
	|	Date,
	|	Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	FixedAssetsDepreciation.Date AS Date,
	|	FixedAssetsDepreciation.Ref AS Ref
	|FROM
	|	Document.FixedAssetsDepreciation AS FixedAssetsDepreciation
	|WHERE
	|	YEAR(FixedAssetsDepreciation.Date) = &Year
	|	AND MONTH(FixedAssetsDepreciation.Date) = &Month
	|	AND FixedAssetsDepreciation.Company = &Company
	|
	|ORDER BY
	|	Date,
	|	Ref";
	
	Query.SetParameter("Year", CurYear);
	Query.SetParameter("Month", CurMonth);
	Query.SetParameter("Company", Company);
	
	QueryResult = Query.ExecuteBatch();
	
	DocSelection = QueryResult[1].Select();
	While DocSelection.Next() Do
		
		DocObject = DocSelection.Ref.GetObject();
		If DocObject.DeletionMark Then
			DocObject.SetDeletionMark(False);
		EndIf;
		
		DocObject.Write(DocumentWriteMode.UndoPosting);
		ReturnStructure.DocumentFixedAssetsDepreciation = DocSelection.Ref;
		
	EndDo;
	
	ReturnStructure.DocumentMonthEnd = Undefined;
	
	DocSelection = QueryResult[0].Select();
	While DocSelection.Next() Do
		
		DocObject = DocSelection.Ref.GetObject();
		If DocObject.DeletionMark Then
			DocObject.SetDeletionMark(False);
		EndIf;
		
		DocObject.Write(DocumentWriteMode.UndoPosting);
		
		If ReturnStructure.DocumentMonthEnd = Undefined Then
			ReturnStructure.DocumentMonthEnd = DocSelection.Ref;
		EndIf;
		
	EndDo;
	
	Return ReturnStructure;
	
EndFunction

#EndRegion

#Region ServiceProceduresAndFunctions

Procedure RunOperationClosingMonth(ParametersStructure, Operations, DocumentClosingMonth)
	
	CurMonth = ParametersStructure.CurMonth;
	CurYear = ParametersStructure.CurYear;
	Company = ParametersStructure.Company;
	
	If DocumentClosingMonth = Undefined Then
		
		DocObject = Documents.MonthEndClosing.CreateDocument();
		DocObject.Company = Company;
		DocObject.Date = EndOfMonth(Date(CurYear, CurMonth, 1));
		DocObject.Comment = NStr("en = '#Created automatically using month-end closing wizard.'");
		
	Else
		
		DocObject = DocumentClosingMonth.GetObject();
		
		If DocObject.DeletionMark Then
			DocObject.SetDeletionMark(False);
		EndIf;
		
		DocObject.DirectCostCalculation = False;
		DocObject.CostAllocation = False;
		DocObject.ActualCostCalculation = False;
		DocObject.FinancialResultCalculation = False;
		DocObject.ExchangeDifferencesCalculation = False;
		DocObject.RetailCostCalculationEarningAccounting = False;
		DocObject.VerifyTaxInvoices = False;
		DocObject.VATPayableCalculation = False;
		
	EndIf;
	
	For Each Operation In Operations Do
		DocObject[Operation] = True;
	EndDo;
	
	DocObject.Write(DocumentWriteMode.Posting);
	
EndProcedure

#EndRegion

#EndIf
